spec/dummy/app/views/cars/_form.html.erb

SELECT "engine_types".* FROM "engine_types"
---
    <%= f.text_field :brand %>
    <%= f.select :engine_type_id, EngineType.all.map{|t| [t.name, t.name]} %>