spec/dummy/app/controllers/cars_controller.rb

INSERT INTO "cars" ("brand", "created_at", "engine_type", "last_service", "name", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @car = Car.new(params[:car])
    respond_to do |format|
      if @car.save

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @car = Car.find(params[:id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
---
  def destroy
    @car = Car.find(params[:id])
    @car.destroy